LIMPIEZA DE nba_player_salaries.csv

1- IMPORTAR LIBRERIAS, CARGAR CSV, LEER LAS COLUMNAS

In [2]:
# ðŸ“Œ Importamos las librerÃ­as necesarias
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# ðŸ“Œ Ruta del archivo CSV
ruta = r"C:\Users\User\OneDrive\Documentos\proyecto_final\data_en_csv\madre\nba_player_salaries.csv"

# ðŸ“Œ Cargamos el CSV
df = pd.read_csv(ruta)

# ðŸ“Œ Mostramos las primeras filas para confirmar la carga
df.head()

,Player Id,Player Name,2022/2023,2023/2024,2024/2025,2024/2025.1
0,1,Stephen Curry,"$48,070,014","$51,915,615","$55,761,217","$59,606,817"
1,2,John Wall,"$47,345,760",$0,$0,$0
2,3,Russell Westbrook,"$47,080,179",$0,$0,$0
3,4,LeBron James,"$44,474,988","$46,698,737","$50,434,636",$0
4,5,Kevin Durant,"$44,119,845","$47,649,433","$51,179,020","$54,708,608"

2- RENOMBRAR COLUMNAS

In [3]:
# ðŸ“Œ Renombrar columnas automÃ¡ticamente (limpieza general)
df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_').str.replace(r'[^\w\s]', '', regex=True)

# ðŸ“Œ Reasignamos manualmente las columnas de aÃ±os
df = df.rename(columns={
    '20222023': '2022',
    '20232024': '2023',
    '20242025': '2024',
    '202420251': '2025'})

# ðŸ“Œ Verificamos los nombres actualizados
print("Nombres de columnas finales:")
print(df.columns.tolist())

Nombres de columnas finales:
['player_id', 'player_name', '2022', '2023', '2024', '2025']

3- VER ESTRUCTURA GENERAL DEL DOCUMENTO

In [4]:
# ðŸ“Œ Estructura general del DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 574 entries, 0 to 573
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   player_id    574 non-null    int64
 1   player_name  574 non-null    object
 2   2022         574 non-null    object
 3   2023         574 non-null    object
 4   2024         574 non-null    object
 5   2025         574 non-null    object
dtypes: int64(1), object(5)
memory usage: 27.0+ KB

In [5]:
# ðŸ“Œ Definimos las columnas de aÃ±os a limpiar
columnas_salario = ['2022', '2023', '2024', '2025']

# ðŸ“Œ Recorremos cada columna para eliminar "$", "," y convertir a numÃ©rico
for col in columnas_salario:
    df[col] = df[col].replace('[\$,]', '', regex=True)  # Elimina $ y ,
    df[col] = pd.to_numeric(df[col], errors='coerce')   # Convierte a float, NaN si no puede

# ðŸ“Œ Verificamos nuevamente los tipos de datos
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 574 entries, 0 to 573
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   player_id    574 non-null    int64
 1   player_name  574 non-null    object
 2   2022         574 non-null    int64
 3   2023         574 non-null    int64
 4   2024         574 non-null    int64
 5   2025         574 non-null    int64
dtypes: int64(5), object(1)
memory usage: 27.0+ KB

<>:6: SyntaxWarning: invalid escape sequence '\$'
<>:6: SyntaxWarning: invalid escape sequence '\$'
C:\Users\User\AppData\Local\Temp\ipykernel_19392\3142165428.py:6: SyntaxWarning: invalid escape sequence '\$'
  df[col] = df[col].replace('[\$,]', '', regex=True)  # Elimina $ y ,

In [6]:
df.head()

   player_id        player_name      2022      2023      2024      2025
0          1      Stephen Curry  48070014  51915615  55761217  59606817
1          2          John Wall  47345760         0         0         0
2          3  Russell Westbrook  47080179         0         0         0
3          4       LeBron James  44474988  46698737  50434636         0
4          5       Kevin Durant  44119845  47649433  51179020  54708608

- VERIFICAMOS SI HAY NOMBRES DUPLICADOS EN LA COLUMNA DE PLAYER_NAME

In [7]:
# ðŸ“Œ Verificamos si hay duplicados exactos en la columna player_name
duplicados = df[df.duplicated(subset='player_name', keep=False)]

# ðŸ“Œ Mostramos los duplicados (si hay)
duplicados

Empty DataFrame
Columns: [player_id, player_name, 2022, 2023, 2024, 2025]
Index: []

- UNIFICAMOS EL NOMBRE DE LOS JUGADORES CON MINUSCULA Y ELIMINAMOS ESPACIO ENTRE PALABRAS

In [8]:
# ðŸ“Œ Estandarizamos los nombres de los jugadores
df['player_name'] = df['player_name'].str.strip().str.lower().str.replace(' ', '_')

# ðŸ“Œ Verificamos los primeros valores
df['player_name'].head()

0        stephen_curry
1            john_wall
2    russell_westbrook
3         lebron_james
4         kevin_durant
Name: player_name, dtype: object

- VERIFICAMOS Y UNIFICAMOS QUE LOS NUMEROS DE LOS JUGADORES SEAN CORRELATIVOS

In [9]:
# ðŸ“Œ Reasignamos player_id con una numeraciÃ³n correlativa desde 1
df['player_id'] = range(1, len(df) + 1)

# ðŸ“Œ Verificamos los primeros valores
df[['player_id', 'player_name']].head()

   player_id        player_name
0          1      stephen_curry
1          2          john_wall
2          3  russell_westbrook
3          4       lebron_james
4          5       kevin_durant

- VERIFICAMOS SI ES QUE HAY VALORES NULOS

In [10]:
# ðŸ“Œ Contamos valores nulos por columna
nulos = df.isnull().sum()

# ðŸ“Œ Mostramos solo las columnas que tienen al menos un nulo
nulos[nulos > 0]

Series([], dtype: int64)

- VERIFICAMOS CUANTAS FILAS TIENE 0 EN LOS ANOS

In [11]:
# ðŸ“Œ Definimos las columnas de los aÃ±os
columnas_salario = ['2022', '2023', '2024', '2025']

# ðŸ“Œ Creamos un diccionario con la cantidad de ceros por columna
ceros_por_columna = {col: (df[col] == 0).sum() for col in columnas_salario}

# ðŸ“Œ Mostramos el resultado como un DataFrame
pd.DataFrame.from_dict(ceros_por_columna, orient='index', columns=['cantidad_de_ceros'])

      cantidad_de_ceros
2022                  0
2023                165
2024                343
2025                439

- IDENTIFICAR CUANTOS JUGADORES TIENE SALARIO EN CADA ANO

In [12]:
# ðŸ“Œ Total de jugadores (por cantidad de filas)
total_jugadores = len(df)

# ðŸ“Œ Creamos un resumen con jugadores con salario > 0 y jugadores con salario = 0
resumen_salarios = {}

for col in ['2022', '2023', '2024', '2025']:
    jugadores_con_salario = (df[col] > 0).sum()
    jugadores_sin_salario = total_jugadores - jugadores_con_salario
    resumen_salarios[col] = {
        'jugadores_con_salario': jugadores_con_salario,
        'jugadores_sin_salario': jugadores_sin_salario}

# ðŸ“Œ Lo mostramos como DataFrame
pd.DataFrame(resumen_salarios).T

      jugadores_con_salario  jugadores_sin_salario
2022                    574                      0
2023                    409                    165
2024                    231                    343
2025                    135                    439

- EXPORTAMOS EL CSV A EN UN NUEVO DATAFRAME

In [14]:
# ðŸ“Œ Exportamos el DataFrame limpio a un nuevo archivo CSV
df.to_csv("nba_salaries_limpio.csv", index=False)

df.to_csv(r"C:\Users\User\OneDrive\Documentos\proyecto_final\data_en_csv\nba_salaries_limpio.csv", index=False)

INICIAMOS EL EDA

- DESCRIBE DE LOS DATOS >0

In [15]:
# ðŸ“Œ Resumen con todos los jugadores
resumen_completo = df[['2022', '2023', '2024', '2025']].describe()

# ðŸ“Œ Resumen SOLO de jugadores con salario > 0
resumen_activos = df[df['2022'] > 0][['2022']].describe().rename(columns={'2022': '2022_activos'})
resumen_activos['2023_activos'] = df[df['2023'] > 0]['2023'].describe()
resumen_activos['2024_activos'] = df[df['2024'] > 0]['2024'].describe()
resumen_activos['2025_activos'] = df[df['2025'] > 0]['2025'].describe()

# ðŸ“Œ Mostramos el resumen filtrado
resumen_activos

       2022_activos  2023_activos  2024_activos  2025_activos
count  5.740000e+02  4.090000e+02  2.310000e+02  1.350000e+02
mean   7.927815e+06  1.035840e+07  1.398163e+07  1.735471e+07
std    1.032043e+07  1.164222e+07  1.371073e+07  1.557560e+07
min    5.849000e+03  9.285700e+04  2.680320e+05  2.680320e+05
25%    1.566388e+06  1.997238e+06  4.227560e+06  6.294178e+06
50%    3.212076e+06  5.539771e+06  8.352367e+06  1.085000e+07
75%    1.001280e+07  1.353482e+07  1.901642e+07  2.493000e+07
max    4.807001e+07  5.191562e+07  5.576122e+07  5.960682e+07

- EXPORTAR ESTE DF COMO CSV

In [16]:
# ðŸ“Œ Exportamos el archivo a la carpeta definida
ruta_export = r"C:\Users\User\OneDrive\Documentos\proyecto_final\data_en_csv\nba_salaries_describe_activos.csv"
resumen_activos.to_csv(ruta_export)

- REVERTIMOS EL PASO DE COLOCAR _ EN LOS ESPACIOS ENTRE NOMBRE Y ADEMAS COLOCAMOS MAYUSCULA A LA PRIMER LETRA DE CADA PALABRA EN LA COLUMNA PLAYER_NAME

In [17]:
# ðŸ“Œ Revertimos el formato de los nombres: _ â†’ espacio + capitalizaciÃ³n por palabra
df['player_name'] = df['player_name'].str.replace('_', ' ').str.title()

# ðŸ“Œ Verificamos el cambio
df[['player_id', 'player_name']].head()

   player_id        player_name
0          1      Stephen Curry
1          2          John Wall
2          3  Russell Westbrook
3          4       Lebron James
4          5       Kevin Durant

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 574 entries, 0 to 573
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   player_id    574 non-null    int64
 1   player_name  574 non-null    object
 2   2022         574 non-null    int64
 3   2023         574 non-null    int64
 4   2024         574 non-null    int64
 5   2025         574 non-null    int64
dtypes: int64(5), object(1)
memory usage: 27.0+ KB

- UNIFICAMOS LAS SIGLAS PARA QUE TENGAN PUNTO ENTRE LAS LETRAS  "A.J."

In [20]:
import re

def insertar_puntos_en_iniciales(nombre):
    # Busca patrones tipo "Aj Griffin", "Jj Redick", etc.
    match = re.match(r"^([A-Za-z])([A-Za-z])\s", nombre)
    if match:
        primera, segunda = match.groups()
        nombre_corregido = nombre.replace(f"{primera}{segunda} ", f"{primera.upper()}.{segunda.upper()}. ", 1)
        return nombre_corregido
    return nombre

# ðŸ“Œ Aplicamos la correcciÃ³n a la columna player_name
df['player_name'] = df['player_name'].apply(insertar_puntos_en_iniciales)

# ðŸ“Œ Verificamos las primeras filas
df[['player_id', 'player_name']].head()

   player_id        player_name
0          1      Stephen Curry
1          2          John Wall
2          3  Russell Westbrook
3          4       Lebron James
4          5       Kevin Durant

In [22]:
# ðŸ“Œ Filtramos las filas donde player_name contiene un punto
df[df['player_name'].str.contains(r'\.', regex=True)]

     player_id      player_name      2022      2023      2024      2025
30          31    C.J. Mccollum  33333333  35802469  33333333  30666666
51          52     A.L. Horford  26500000  10000000   9500000         0
82          83     O.G. Anunoby  17357143  18642857  19928571         0
122        123      J.A. Morant  12119440  33500000  36180000  38860000
131        132     R.J. Barrett  10900634  23883929  25794643  27705357
137        138      P.J. Tucker  10490000  11014500  11539000         0
139        140       M.O. Bamba  10300000  10300000         0         0
175        176   T.J. Mcconnell   8100000   8700000   9300000         0
212        213  P.J. Washington   5808435   7992407         0         0
234        235      T.Y. Jerome   4728948   1761752         0         0
275        276     A.J. Griffin   3536160   3712920   3889920   5967137
311        312     R.J. Hampton   2898243   1927896         0         0
323        324      T.J. Warren   2628597         0         0         0
396        397      K.Z. Okpala   1902133         0         0         0
413        414      K.J. Martin   1782621   1930681         0         0
431        432        J.T. Thor   1563518   1836096   1988598         0
433        434      B.J. Boston   1563518   1836096         0         0
472        473      P.J. Dozier    784654   2413304         0         0
478        479    D.J. Augustin    633938         0         0         0
489        490     E.J. Liddell    508891    547349         0         0
493        494     J.D. Davison    508891   1761752         0         0
508        509       A.J. Green    508891   1761752         0         0
522        523      A.J. Lawson    371432   1761752         0         0
530        531      D.J. Wilson    250000         0         0         0
564        565     D.J. Steward     50000         0         0         0

- EXPORTAMOS NUEVAMENTE EL DF LIMPIO CON LA MODIFICACION DE LOS _

In [23]:
# ðŸ“Œ Exportamos sobrescribiendo el archivo anterior
df.to_csv(r"C:\Users\User\OneDrive\Documentos\proyecto_final\data_en_csv\nba_salaries_limpio.csv", index=False)